UBend_CHT/aero/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    inlet
    {
        type            patch;
        nFaces          617;
        startFace       1459391;
    }
    outlet
    {
        type            patch;
        nFaces          609;
        startFace       1460008;
    }
    farfield_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2874;
        startFace       1460617;
    }
    farfield_right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          786;
        startFace       1463491;
    }
    farfield_left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          780;
        startFace       1464277;
    }
    farfield_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1032;
        startFace       1465057;
    }
    ubend_outer
    {
        type            wall;
        inGroups        1(wall);
        nFaces          41434;
        startFace       1466089;
    }
    ubend_inner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          37384;
        startFace       1507523;
    }
    farfield_inlet
    {
        type            patch;
        nFaces          668;
        startFace       1544907;
    }
    farfield_outlet
    {
        type            patch;
        nFaces          654;
        startFace       1545575;
    }
)

// ************************************************************************* //
