UBend_CHT/aero/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -5.0);

boundaryField
{
    
    inlet
    {
        type            fixedValue;
        value           uniform (0 5 0);
    }

    farfield_inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(outlet|farfield_outlet)"
    {
        type            zeroGradient;
    }

    "(ubend_inner|ubend_outer|farfield_top|farfield_right|farfield_left|farfield_bottom)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
