UBend_CHT/aero/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.7e-3;

boundaryField
{
    
    "(inlet|farfield_inlet|outlet|farfield_outlet)"
    {
        type            calculated;
        value           $internalField;
    }

    "(ubend_inner|ubend_outer|farfield_top|farfield_right|farfield_left|farfield_bottom)"
    {
        type            incompressible::alphatWallFunction;
        Prt             1.0;
        value           uniform 0;
    }

}
// ************************************************************************* //
